Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_abroad/leaving_ireland/diplomatic_supports.html.txt.tmx
Source language: en
Languages: ga

source: Diplomatic supports for Irish people abroad
ga: Tacaíocht taidhleoireachta d'Éireannaigh thar lear

source: If you are in need of advice or assistance while you are abroad, you can call on the Irish embassy or consulate in that country
ga: Má theastaíonn comhairle nó cúnamh uait agus tú thar lear, is féidir glaoch ar Ambasáid nó Consalacht na hÉireann sa tír sin

source: There are Irish embassies and consulates-general located in countries throughout the world
ga: Tá ambasáid agus consalachtaí-ginearálta suit i dtíortha eagsúla ar fud an domhain

source: If you are in a country where there is no embassy or consulate, you may look for advice and assistance from embassies or consulates of other European Union countries
ga: Más i dtír thú nach bhfuil aon ambasád ná consalacht ann, is féidir leat comhairle agus cúnamh a lorg ó ambasáid nó consalacht de chuid tíortha eile an Chomhphobail

source: Embassies and consulates can be of assistance if:
ga: Is féidir le hambasáid nó consalachtaí cúnamh a thabhairt:

source: • You need an emergency passport
ga: • Má theastaíonn pas éigeandála uait

source: • You have been the victim of crime or illness or have had a serious accident
ga: • Má tá tú thíos le coir, nó tinneas ort, nó má tharla drochthimpiste duit

source: • You have been arrested or imprisoned while abroad
ga: • Má gabhadh thú nó má cuireadh sa phríosún thar lear thú

source: • You need help in transferring funds from home where more conventional means are not available
ga: • Má theastaíonn uait airgead a aistriú ón mbaile nuair nach féidir leat úsáid a bhaint as na gnáthbhealaí

source: • There is a death abroad and the remains need to be returned to Ireland
ga: • Má cailltear duine thar lear agus teastaíonn an corp a thabhairt abhaile go hÉirinn

source: There is a limit to the services the embassy or consulate can provide
ga: Tá na seirbhísí gur féidir le hambasáid nó consalacht teoranta

source: For example, if you have been ill or in an accident, they can:
ga: Mar shampla, má tá duine tinn nó má bhí drochthimpiste ag duine is féidir leo:

source: • Inform family or friends about your accident or illness
ga: • Insint don teaghlach nó do chairde faoin timpiste nó tinneas

source: • Advise on local medical services and lists of English-speaking doctors
ga: • Comhairle a thabhairt ar sheirbhísí leighis áitiúil agus liosta dochtúirí le Béarla a chur ar fáil

source: • Liaise with local medical services on your behalf
ga: • Dealáil leis na seirbhísí áitiúla leighis ar do shon

source: They cannot, however, offer medical advice, pay medical bills or pursue compensation claims on your behalf
ga: Ní féidir leo, áfach, comhairle leighis a chur ar fáil, billí leighis a íoc nó iarratais ar chúiteamh a dhéanamh ar do shon

source: Nor will they be able to pay for relatives to come to see you
ga: Ní féidir leo ach an oiread íoc as gaolta teacht ar cuairt chugat

source: Further information about the range of services relating to the consular protection of Irish citizens is available from the Consular Section of the Department of Foreign Affairs and Trade – see 'Where to apply' below
ga: Tá tuilleadh eolais faoi na seirbhísí maidir le cosaint consulacha ar fáil ón Rannóg Consulachta na Roinne Gnóthaí Eachtracha agus Trádála – féach ‘Cá háit a dhéanfaidh mé iarratas’

source: The Department has also developed a free smartphone app called TravelWise which has travel advice and consular information on 200 countries
ga: Forbraíodh an Roinn aip fóin cliste saor in aisce ar a dtugtar TravelWise go bhfuil comhairle taistil agus faisnéis chonsalach le haghaidh 200 tír aici

source: The app is available from the Apple and Android stores
ga: Tá an aip ar fáil ó stórtha Apple agus Android

source: Repatriation of Irish people from abroad
ga: Aisdúichiú daoine Éireannacha ó áiteanna thar lear

source: In very exceptional circumstances, where the health or security of an Irish citizen abroad is at risk and there is no way of dealing with the situation satisfactorily locally, the Department of Foreign Affairs and Trade may agree to repatriate the person to Ireland
ga: I gcúinsí fíor-eisceachtúla, ina bhfuil sláinte nó sábháilteacht shaoránach Éireannach thar lear i mbaol agus nach bhfuil aon slí le déileáil leis an scéal go háitiúil ar bhealach sásúil, d’fhéadfadh an Roinn Gnóthaí Eachtracha agus Trádála in Éirinn a bheith sásta an duine a aisdúichiú go hÉireann

source: This will be done at the sole discretion of the Department
ga: Beidh sé faoi lánrogha na Roinne é seo a dhéanamh

source: In addition, repatriation in this instance is subject to strict conditions which will be set out and explained clearly in each individual case
ga: Chomh maith leis sin, tá aisdúichiú sa chás seo faoi réir coinníollacha dochta a leagfar amach agus a mhíneofar go soiléir i ngach cás ar leith

source: The conditions include a written undertaking to repay all the expenses incurred as well as a statutory fee for this service
ga: Cuimsíonn na coinníollacha gealltanas scríofa go n-aisíocfar na costais go léir a thabhaítear chomh maith le táille reachtúil ar an seirbhís seo
